# More Practice With SQL Queries - Lab

## Introduction

In this lesson, we'll run through some practice questions to refresh our knowledge of SQL Queries!

## Objectives

You will be able to:

- Practice your SQL knowledge

## Getting Started

As in previous labs, we'll make use of the `sqlite3` library as well as `pandas`. By combining them, we'll be able to write our queries as python strings, and make sure that the results are always returned as a pandas DataFrame. 

We'll start by loading both libraries and connecting to the database we'll be using for this lab, `data.sqlite`. You may remember this database from a previous lab. As a refresher, here's the ERD diagram for this database: 

<img src='images/Database-Schema.png'>

In the cell below:

* Import the necessary libraries `pandas` and `sqlite3`
* Establish a connection to the database `data.sqlite`
* Get the `cursor` from the connection and store it in the variable `c`.

In [3]:
import pandas as pd
import sqlite3
conn = sqlite3.Connection('data.sqlite')
c = conn.cursor()

## Basic Queries

Now, let's review basic SQL queries. In the cell below:

* Write a query that gets the first name, last name, phone number, address, and credit limit for all customers in California with a credit limit greater than 25000.00.

In [4]:
# For the first query, the boilerplate for getting 
#the query into a dataframe has been provided for you
c.execute(""" 
    select *
    from sqlite_master
;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

,type,name,tbl_name,rootpage,sql
0,table,orderdetails,orderdetails,2,"CREATE TABLE `orderdetails` (`orderNumber`, `p..."
1,table,payments,payments,28,"CREATE TABLE `payments` (`customerNumber`, `ch..."
2,table,offices,offices,32,"CREATE TABLE `offices` (`officeCode`, `city`, ..."
3,table,orders,orders,38,"CREATE TABLE `orders` (`orderNumber`, `orderDa..."
4,table,productlines,productlines,46,"CREATE TABLE `productlines` (`productLine`, `t..."
5,table,products,products,47,"CREATE TABLE `products` (`productCode`, `produ..."
6,table,employees,employees,56,"CREATE TABLE `employees` (`employeeNumber`, `l..."
7,table,customers,customers,33,CREATE TABLE customers (customerNumber INTEGE...

In [8]:
# For the first query, the boilerplate for getting 
#the query into a dataframe has been provided for you
c.execute(""" 
    select contactFirstName, contactLastName, phone, addressLine1, creditLimit
    from customers
    where creditLimit > 25000 and state = 'CA'
;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

,contactFirstName,contactLastName,phone,addressLine1,creditLimit
0,Susan,Nelson,4155551450,5677 Strong St.,210500.0
1,Julie,Murphy,6505555787,5557 North Pendale Street,64600.0
2,Juri,Hashimoto,6505556809,9408 Furth Circle,84600.0
3,Julie,Young,6265557265,78934 Hillside Dr.,90700.0
4,Valarie,Thompson,7605558146,361 Furth Circle,105000.0
5,Julie,Brown,6505551386,7734 Strong St.,105000.0
6,Brian,Chandler,2155554369,6047 Douglas Av.,57700.0
7,Sue,Frick,4085553659,3086 Ingle Ln.,77600.0
8,Steve,Thompson,3105553722,3675 Furth Circle,55400.0
9,Sue,Taylor,4155554312,2793 Furth Circle,60300.0

#### Expected Output

<img src='images/expected-output-1.png'>

## Aggregate Functions and GROUP BY

Next, write a query that get sthe average credit limit per state.

In [12]:
c.execute(""" 
    select state, avg(creditLimit) as avg_cred_lim
    from customers
    group by state
    --order by 2 desc
;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

            state   avg_cred_lim
0                   61839.726027
1              BC   89950.000000
2              CA   83854.545455
3              CT   57350.000000
4        Co. Cork       0.000000
5   Isle of Wight   93900.000000
6              MA   70755.555556
7              NH  114200.000000
8              NJ   43000.000000
9             NSW  100550.000000
10             NV   71800.000000
11             NY   89966.666667
12          Osaka   81200.000000
13             PA   84766.666667
14       Pretoria       0.000000
15     Queensland   51600.000000
16         Québec   48700.000000
17          Tokyo   94400.000000
18       Victoria   88800.000000

#### Expected Output

<img src='images/expected-output-2.png'>

## JOINs

Now, write a query that uses JOIN statements to get the customer name, customer number, order number, status, and quantity ordered. Print only the head of this DataFrame.

In [36]:
c.execute(""" 
    select customerName, c.customerNumber, o.orderNumber, status, quantityOrdered, productCode
    from customers c
    left join orders o
    on c.customerNumber = o.customerNumber
    left join orderdetails d
    on o.orderNumber = d.orderNumber
    
;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df.head()

,customerName,customerNumber,orderNumber,status,quantityOrdered,productCode
0,Atelier graphique,103,10123,Shipped,26,S18_1589
1,Atelier graphique,103,10123,Shipped,46,S18_2870
2,Atelier graphique,103,10123,Shipped,34,S18_3685
3,Atelier graphique,103,10123,Shipped,50,S24_1628
4,Atelier graphique,103,10298,Shipped,39,S10_2016

In [33]:
c.execute(""" 
    select *
    from products
    limit 1
;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP
0,S10_1678,1969 Harley Davidson Ultimate Chopper,Motorcycles,1:10,Min Lin Diecast,"This replica features working kickstand, front...",7933,48.81,95.70

In [35]:
c.execute(""" 
    select *
    from orderdetails
    limit 1
;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

  orderNumber productCode quantityOrdered priceEach orderLineNumber
0       10100    S18_1749              30    136.00               3

#### Expected Output

<img src='images/expected-output-3.png'>

## HAVING and ORDER BY

Now, return the customerName, customrerNumber, productName, productCode and total number ordered for any product a customer has bought 10 or more of cumulatively. Sort the rows in descending order by the quantity ordered. 

**_Hint_**: For this one, you'll need to make use of HAVING, GROUP BY, and ORDER BY--make sure you get the order of them correct!

In [43]:
c.execute(""" 
    select customerName, c.customerNumber, o.orderNumber, status, quantityOrdered, d.productCode, productName
    from customers c
    left join orders o
    on c.customerNumber = o.customerNumber
    left join orderdetails d
    on o.orderNumber = d.orderNumber
    left join products pr
    on d.productCode = pr.productCode
     
;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

,customerName,customerNumber,orderNumber,status,quantityOrdered,productCode,productName
0,Atelier graphique,103,10123,Shipped,26,S18_1589,1965 Aston Martin DB5
1,Atelier graphique,103,10123,Shipped,46,S18_2870,1999 Indy 500 Monte Carlo SS
2,Atelier graphique,103,10123,Shipped,34,S18_3685,1948 Porsche Type 356 Roadster
3,Atelier graphique,103,10123,Shipped,50,S24_1628,1966 Shelby Cobra 427 S/C
4,Atelier graphique,103,10298,Shipped,39,S10_2016,1996 Moto Guzzi 1100i
5,Atelier graphique,103,10298,Shipped,32,S18_2625,1936 Harley Davidson El Knucklehead
6,Atelier graphique,103,10345,Shipped,43,S24_2022,1938 Cadillac V-16 Presidential Limousine
7,Signal Gift Stores,112,10124,Shipped,21,S18_1749,1917 Grand Touring Sedan
8,Signal Gift Stores,112,10124,Shipped,42,S18_2248,1911 Ford Town Car
9,Signal Gift Stores,112,10124,Shipped,42,S18_2325,1932 Model A Ford J-Coupe
10,Signal Gift Stores,112,10124,Shipped,36,S18_4409,1932 Alfa Romeo 8C2300 Spider Sport
11,Signal Gift Stores,112,10124,Shipped,23,S18_4933,1957 Ford Thunderbird
12,Signal Gift Stores,112,10124,Shipped,22,S24_1046,1970 Chevy Chevelle SS 454
13,Signal Gift Stores,112,10124,Shipped,45,S24_1937,1939 Chevrolet Deluxe Coupe
14,Signal Gift Stores,112,10124,Shipped,22,S24_2022,1938 Cadillac V-16 Presidential Limousine
15,Signal Gift Stores,112,10124,Shipped,32,S24_2766,1949 Jaguar XK 120
16,Signal Gift Stores,112,10124,Shipped,25,S24_2887,1952 Citroen-15CV
17,Signal Gift Stores,112,10124,Shipped,49,S24_3191,1969 Chevrolet Camaro Z28
18,Signal Gift Stores,112,10124,Shipped,43,S24_3432,2002 Chevy Corvette
19,Signal Gift Stores,112,10124,Shipped,46,S24_3969,1936 Mercedes Benz 500k Roadster
20,Signal Gift Stores,112,10278,Shipped,34,S18_1129,1993 Mazda RX-7
21,Signal Gift Stores,112,10278,Shipped,23,S18_1589,1965 Aston Martin DB5
22,Signal Gift Stores,112,10278,Shipped,29,S18_1889,1948 Porsche 356-A Roadster
23,Signal Gift Stores,112,10278,Shipped,29,S18_1984,1995 Honda Civic
24,Signal Gift Stores,112,10278,Shipped,39,S18_2870,1999 Indy 500 Monte Carlo SS
25,Signal Gift Stores,112,10278,Shipped,42,S18_3232,1992 Ferrari 360 Spider red
26,Signal Gift Stores,112,10278,Shipped,31,S18_3685,1948 Porsche Type 356 Roadster
27,Signal Gift Stores,112,10278,Shipped,35,S24_1628,1966 Shelby Cobra 427 S/C
28,Signal Gift Stores,112,10278,Shipped,31,S24_2972,1982 Lamborghini Diablo
29,Signal Gift Stores,112,10278,Shipped,25,S24_3856,1956 Porsche 356A Coupe
...,...,...,...,...,...,...,...
2990,Kelly's Gift Shop,496,10179,Cancelled,34,S50_1341,1930 Buick Marquette Phaeton
2991,Kelly's Gift Shop,496,10179,Cancelled,23,S700_1691,American Airlines: B767-300
2992,Kelly's Gift Shop,496,10179,Cancelled,25,S700_2834,ATA: B757-300
2993,Kelly's Gift Shop,496,10179,Cancelled,39,S700_3167,F/A 18 Hornet 1/72
2994,Kelly's Gift Shop,496,10360,Shipped,50,S18_1662,1980s Black Hawk Helicopter
2995,Kelly's Gift Shop,496,10360,Shipped,41,S18_2581,P-51-D Mustang
2996,Kelly's Gift Shop,496,10360,Shipped,46,S18_3029,1999 Yamaha Speed Boat
2997,Kelly's Gift Shop,496,10360,Shipped,29,S18_3140,1903 Ford Model A
2998,Kelly's Gift Shop,496,10360,Shipped,29,S18_3259,Collectable Wooden Train
2999,Kelly's Gift Shop,496,10360,Shipped,40,S18_3856,1941 Chevrolet Special Deluxe Cabriolet
3000,Kelly's Gift Shop,496,10360,Shipped,40,S18_4522,1904 Buick Runabout
3001,Kelly's Gift Shop,496,10360,Shipped,22,S24_1785,1928 British Royal Navy Airplane
3002,Kelly's Gift Shop,496,10360,Shipped,31,S24_2011,18th century schooner
3003,Kelly's Gift Shop,496,10360,Shipped,49,S24_2841,1900s Vintage Bi-Plane
3004,Kelly's Gift Shop,496,10360,Shipped,36,S24_3151,1912 Ford Model T Delivery Wagon
3005,Kelly's Gift Shop,496,10360,Shipped,22,S24_3816,1940 Ford Delivery Sedan
3006,Kelly's Gift Shop,496,10360,Shipped,32,S700_1138,The Schooner Bluenose
3007,Kelly's Gift Shop,496,10360,Shipped,26,S700_1938,The Mayflower
3008,Kelly's Gift Shop,496,10360,Shipped,30,S700_2610,The USS Constitution Ship
3009,Kelly's Gift Shop,496,10360,Shipped,35,S700_3505,The Titanic
3010,Kelly's Gift Shop,496,10360,Shipped,31,S700_3962,The Queen Mary
3011,Kelly's Gift Shop,496,10360,Shipped,31,S72_3212,Pont Yacht
3012,Kelly's Gift Shop,496,10399,Shipped,40,S10_1678,1969 Harley Davidson Ultimate Chopper
3013,Kelly's Gift Shop,496,10399,Shipped,51,S10_2016,1996 Moto Guzzi 1100i
3014,Kelly's Gift Shop,496,10399,Shipped,22,S10_4698,2003 Harley-Davidson Eagle Drag Bike
3015,Kelly's Gift Shop,496,10399,Shipped,29,S12_2823,2002 Suzuki XREO
3016,Kelly's Gift Shop,496,10399,Shipped,30,S18_2625,1936 Harley Davidson El Knucklehead
3017,Kelly's Gift Shop,496,10399,Shipped,57,S24_1578,1997 BMW R 1100 S
3018,Kelly's Gift Shop,496,10399,Shipped,58,S24_2000,1960 BSA Gold Star DBD34
3019,Kelly's Gift Shop,496,10399,Shipped,32,S32_1374,1997 BMW F650 ST

In [32]:
c.execute(""" 
    select *
    from customers c
    join orders o
    on c.customerNumber = o.customerNumber
    limit 1
;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
0,363,Online Diecast Creations Co.,Young,Dorothy,6035558647,2304 Long Airport Avenue,,Nashua,NH,62005,USA,1216,114200.0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363

#### Expected Output

<img src='images/expected-output-4.png'>

## Subqueries

Finally, get the first name, last name, employee number, and office code for employees from an office with less than 5 employees.

#### Expected Output

<img src='images/expected-output-5.png'>

# Summary

In this lesson, we reviewed all the major concepts and keywords associated with SQL queries!